In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [3]:
a = [1,2, 3]
a[0]
b = [4,5,6]

In [4]:
a+b

[1, 2, 3, 4, 5, 6]

In [6]:
n1 = np.array([1,1,1])
n2 = np.array([2,2,2])
np.dot(n1,n2)

6

In [9]:
df = pd.read_csv('data/test-header.csv')
df

  name   age  money
0   둘리  45.0   1000
1  도우너  44.0   2000
2   또치  50.0   1500
3  고길동  70.0    100
4  김희동   NaN    100

In [10]:
df.head

<bound method NDFrame.head of   name   age  money
0   둘리  45.0   1000
1  도우너  44.0   2000
2   또치  50.0   1500
3  고길동  70.0    100
4  김희동   NaN    100>

In [11]:
df.info

<bound method DataFrame.info of   name   age  money
0   둘리  45.0   1000
1  도우너  44.0   2000
2   또치  50.0   1500
3  고길동  70.0    100
4  김희동   NaN    100>

In [12]:
df = pd.read_csv('./data/test.csv', header=None)
df.columns = ['name', 'age', 'money']
df

  name  age  money
0   둘리   45   1000
1  도우너   44   2000
2   또치   50   1500

In [13]:
df = pd.read_csv('./data/test.csv', header=None, 
                 names=['name', 'age', 'money'])
df

  name  age  money
0   둘리   45   1000
1  도우너   44   2000
2   또치   50   1500

In [14]:
df.index = ['2018-04-01', '2018-04-02', '2018-04-03']
df

           name  age  money
2018-04-01   둘리   45   1000
2018-04-02  도우너   44   2000
2018-04-03   또치   50   1500

In [15]:
item1 = [
    {'name':'apple','price': 30},
    {'name':'banana','price': 50},
    {'name':'carrot','price': 999},
        ]

In [16]:
df = pd.DataFrame(item1)
df

     name  price
0   apple     30
1  banana     50
2  carrot    999

In [17]:
item2 = [    
    ['apple', 50, 1.22],
    ['banana', 20, 0.22],
    ['carrot', 20, 0.12],
]
item2

[['apple', 50, 1.22], ['banana', 20, 0.22], ['carrot', 20, 0.12]]

In [18]:
df = pd.DataFrame.from_records(item2, columns=['name','ea','price'])
df

     name  ea  price
0   apple  50   1.22
1  banana  20   0.22
2  carrot  20   0.12

In [19]:
df.loc[ [0, 2] ]

     name  ea  price
0   apple  50   1.22
2  carrot  20   0.12

In [20]:
a = df.loc[1]
a

name     banana
ea           20
price      0.22
Name: 1, dtype: object

In [21]:
df.loc[1]['name']

'banana'

In [22]:
df.iloc[0:2, 1:3]

   ea  price
0  50   1.22
1  20   0.22

In [23]:
df

     name  ea  price
0   apple  50   1.22
1  banana  20   0.22
2  carrot  20   0.12